{
  "Common": {
    "websiteTitle": "Hagaha Barashada Python",
    "language": "Luqadda"
  },
  "Navigation": {
    "home": "Bogga Hore",
    "guide": "Hagaha Python",
    "about": "Iga Waran"
  },
  "Home": {
    "title": "Ku soo dhowow Hagaha Barashada Python",
    "subtitle": "Waddada dhammeystiran ee lagu noqdo horumariye Python",
    "description": "Hagahani wuxuu bixiyaa hab habaysan oo lagu barto barnaamijyada Python, laga bilaabo asaasiyaadka ilaa iyo inta laga diyaar garoobayo shaqada horumariye.",
    "getStartedButton": "Arag Hagaha",
    "features": {
      "beginner": {
        "title": "U Fiican Bilowgalayaasha",
        "description": "Ku bilow asaasiyaadka oo dhis aasaas adag"
      },
      "practical": {
        "title": "Mashruucyo Dhab ah",
        "description": "Baro adigoo dhisaya mashruucyo dhab ah oo adag"
      },
      "comprehensive": {
        "title": "Waddo Dhammeystiran",
        "description": "Laga bilaabo asaasiyaadka ilaa horumarinta xirfadeed oo leh Git, APIs, iyo in ka badan"
      }
    }
  },
  "Guide": {
    "title": "Hagaha Barashada Python",
    "intro": "Hagaha talaabo-tallaabada ah ee lagu noqdo horumariye Python oo khibrad leh",
    "steps": {
      "step1": {
        "title": "Baro Asaasiyaadka",
        "content": "Marka hore, waxaad u baahan doontaa inaad barato waxyaabaha ugu sahlan sida statements-ka daabacaadda, fikradaha aasaasiga ah ee barnaamijyada. Waxaa jira laba hab oo la taliyay:",
        "options": {
          "option1": "Daawo Fireship (muuqaalada degdegga ah) oo si toos ah uga hel waayo-aragnimo. Tani waxay ku shaqeysaa haddii aad leedahay qaab waxbarasho oo dhab ah.",
          "option2": "Samee barnaamij ama koorso habeysan. Ikhtiyaarada la taliyay waxaa ka mid ah Mosh ama Tech with Tim. Mosh wuxuu bixiyaa tababbar bilowga ah oo heer sare ah oo daboolaya asaasiyaadka Python."
        }
      },
      "step2": {
        "title": "Dhis Mashruucyo Fudud",
        "content": "Haddaba, hel waayo-aragnimo wax-ku-ool ah oo leh mashaariic yaryar. Isku day inaad sameyso ciyaaro aasaasi ah sida tic-tac-toe ama ciyaaro ku salaysan shabakad sida Connect 4."
      },
      "step3": {
        "title": "Baro Git",
        "content": "SI AAD U NOQOTO HORUMARIYE WAA INAAD FAHAMTO GIT. WAY KA FUDUDAHAY SIDII AY U MUUQATAY. Fireship wuxuu leeyahay muuqaallo badan oo waxtar leh oo sharxaya Git iyo sida si waxtar leh loogu isticmaalo."
      },
      "step4": {
        "title": "Qaado Mashruucyo Caqabad leh",
        "content": "Hadda oo aad fahamtay asaasiyaadka, iskugu dheelli tir mashaariic dhib badan oo bilowga u muuqda inay dhaafsiisan yihiin heerkaaga xirfadeed ee hadda.",
        "details": {
          "detail1": "Dooro mashaariic ku dhiirrigeliya ama kugu dhaliyo xiisahaaga.",
          "detail2": "Mashruucaagu waa inuu ku darsado fikrado cusub sida:",
          "concepts": {
            "packages": "Isticmaalka xirmooyinka iyo maktabadaha dibadda",
            "oop": "Barnaamij ku salaysan wax",
            "sql": "Isdhexgalka SQL iyo kayd xogta",
            "api": "La shaqaynta APIs"
          },
          "examples": {
            "example1": "Bogga internetka ee aasaasiga ah ee isticmaalaya API dadweynaha si uu u muujiyo macluumaadka",
            "example2": "Ciyaar leh interface graphics heerka sare ah"
          }
        }
      },
      "step5": {
        "title": "Dhis Codka Kaabaysha Buuxa",
        "content": "Waa waqtigii la isku keeni lahaa wax walba oo la abuuri lahaa codsiga kaabaysha buuxa oo leh isticmaalka Git ee habboon, keydka xogta, iyo bog web oo xirfadle ah oo isticmaalaya HTML, CSS, iyo suurtagalka JavaScript."
      },
      "step6": {
        "title": "Ku Tababbaro Wareysiyada Farsamada",
        "content": "Hadda oo aad tahay horumariye, u diyaargarow wareysiyada farsamada adoo ku tababbarnaya qaab-dhismeedyada xogta iyo algorithms-ka. Kuwani way adag yihiin laakiin waa muhiim shaqo-codsiyada. Ku tababbaro bogagga sida LeetCode ama NeetCode."
      }
    },
    "resources": {
      "title": "Ilaha La Taliyay",
      "channels": {
        "title": "Kanaalada YouTube",
        "fireship": "Fireship - Tababarro degdeg ah oo kooban",
        "techwithTim": "Tech with Tim - Python sida ugu dhakhsaha badan ee suurtogalka ah (Baro Python ~75 Daqiiqo)",
        "mosh": "Mosh Python Course - Python Full Course for Beginners (6 saacadood, oo loo kala qaybiyay qaybaha)",
        "brocode": "Bro Code - Koorsada buuxda ee Python oo bilaash ah, faahfaahsan laakiin kooban"
      },
      "git": {
        "title": "Ilaha Git",
        "explanation": "Fireship: Git oo lagu sharxay 100 Ilbiriqsi",
        "tutorial": "Fireship: Sida loo isticmaalo Git"
      },
      "practice": {
        "title": "Goobaha Tababbarka",
        "leetcode": "LeetCode - Ku tababbaro su'aalaha wareysiga iyo algorithms",
        "neetcode": "NeetCode - Dhibaatooyin dheeraad ah iyo xalal"
      },
      "courses": {
        "title": "Koorsooyinka La Taliyay",
        "harvard": "Harvard Computer Science (CS50) - Hordhaca Sayniska Kombiyuutarka"
      }
    }
  },
  "About": {
    "title": "Iga Waran",
    "subtitle": "Abuuraha hagaha Python ee adiga",
    "biography": "Waxaan ku xishooneynaa inaan caawiyo kuwa kale inay bartaan coding oo ay noqdaan horumariyayaal guuleysta. Sanado waayo-aragnimo ah oo ku jira horumarinta Python iyo wax barista, waxaan abuuray hagahan si aan u bixiyo hab habaysan oo lagu barto barnaamijyada.",
    "experience": {
      "title": "Waayo-aragnimo",
      "years": "Sanado Horumarineed",
      "projects": "Mashaariic la dhameeyay",
      "students": "Ardayda la hagay"
    },
    "contact": {
      "title": "La Xiriir",
      "description": "Ma qabtaa su'aalo ama ma u baahan tahay hagitaan shakhsiyeed? Fadlan nala soo xiriir!",
      "email": "Email",
      "github": "GitHub",
      "twitter": "Twitter",
      "linkedin": "LinkedIn"
    }
  },
  "LanguageSwitcher": {
    "english": "English",
    "somali": "Soomaali"
  }
}
